src/test/jmeter/booking_concurrency_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="FieldFinder — Kiểm thử Concurrency Đặt Sân (Chống Đặt Trùng Lịch)" enabled="true">
      <stringProp name="TestPlan.comments">
        ============================================================
        JMETER TEST PLAN — FieldFinder Anti-Double-Booking Concurrency
        ============================================================
        Mục tiêu: Giả lập N người dùng đồng thời đặt cùng 1 sân, cùng 1 khung giờ.
        Kết quả mong đợi: Chỉ 1 đơn thành công. N-1 đơn bị từ chối (Redis SETNX).

        Cách chạy:
          1. Mở JMeter 5.6.3+
          2. File > Open > booking_concurrency_test.jmx
          3. Điều chỉnh User Defined Variables (BASE_URL, PITCH_ID, USER_IDs, JWT_TOKEN)
          4. Run từng Thread Group (10/50/100 users)
          5. Xem kết quả trong View Results Tree và Summary Report

        Cách chạy không giao diện (CLI):
          jmeter -n -t booking_concurrency_test.jmx -l results_10users.jtl -e -o report_10users/
          jmeter -n -t booking_concurrency_test.jmx -l results_50users.jtl -JTHREAD_COUNT=50 -e -o report_50users/
          jmeter -n -t booking_concurrency_test.jmx -l results_100users.jtl -JTHREAD_COUNT=100 -e -o report_100users/
      </stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>

      <!-- ═══════════════════════════════════════════════════════════
           BIẾN TOÀN CỤC — ĐIỀU CHỈNH TRƯỚC KHI CHẠY
           ═══════════════════════════════════════════════════════════ -->
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
        <collectionProp name="Arguments.arguments">
          <!-- URL backend đang chạy -->
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
          </elementProp>
          <elementProp name="BASE_PORT" elementType="Argument">
            <stringProp name="Argument.name">BASE_PORT</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
          </elementProp>
          <!-- UUID của sân cần test (lấy từ DB: SELECT pitch_id FROM pitches LIMIT 1) -->
          <elementProp name="PITCH_ID" elementType="Argument">
            <stringProp name="Argument.name">PITCH_ID</stringProp>
            <stringProp name="Argument.value">REPLACE_WITH_REAL_PITCH_UUID</stringProp>
          </elementProp>
          <!-- UUID của user (lấy từ DB: SELECT user_id FROM users WHERE role='USER' LIMIT 1) -->
          <elementProp name="USER_ID" elementType="Argument">
            <stringProp name="Argument.name">USER_ID</stringProp>
            <stringProp name="Argument.value">REPLACE_WITH_REAL_USER_UUID</stringProp>
          </elementProp>
          <!-- JWT Token của user (lấy từ Login API hoặc đăng nhập FE) -->
          <elementProp name="JWT_TOKEN" elementType="Argument">
            <stringProp name="Argument.name">JWT_TOKEN</stringProp>
            <stringProp name="Argument.value">REPLACE_WITH_REAL_JWT_TOKEN</stringProp>
          </elementProp>
          <!-- Slot ID cần tranh giành (SELECT slot_id FROM time_slots WHERE start_time > NOW() + 2h) -->
          <elementProp name="SLOT_ID" elementType="Argument">
            <stringProp name="Argument.name">SLOT_ID</stringProp>
            <stringProp name="Argument.value">3</stringProp>
          </elementProp>
          <!-- Ngày đặt sân (ít nhất 2 tiếng từ giờ chạy test) -->
          <elementProp name="BOOKING_DATE" elementType="Argument">
            <stringProp name="Argument.name">BOOKING_DATE</stringProp>
            <stringProp name="Argument.value">2026-06-30</stringProp>
          </elementProp>
          <!-- Giá slot (VND) -->
          <elementProp name="SLOT_PRICE" elementType="Argument">
            <stringProp name="Argument.name">SLOT_PRICE</stringProp>
            <stringProp name="Argument.value">150000</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>

    <hashTree>

      <!-- ═══════════════════════════════════════════════════════════
           KỊCH BẢN 1: 10 NGƯỜI DÙNG ĐỒNG THỜI
           ═══════════════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="KB1 — 10 Người Dùng Đồng Thời (Cùng Sân/Slot)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <!-- Số users: 10 -->
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <!-- Ramp-up = 0: tất cả 10 users bắt đầu CÙNG LÚC -->
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>

      <hashTree>
        <!-- HTTP Header Manager — gắn JWT Token cho tất cả request -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                       testname="HTTP Headers (Auth + Content-Type)" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${JWT_TOKEN}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- HTTP Request: POST /api/bookings -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="POST /api/bookings — Đặt Sân (Tranh Giành Slot)" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "pitchId": "${PITCH_ID}",
  "userId": "${USER_ID}",
  "bookingDate": "${BOOKING_DATE}",
  "totalPrice": ${SLOT_PRICE},
  "bookingDetails": [
    {
      "slot": ${SLOT_ID},
      "name": "Slot ${SLOT_ID} - JMeter Concurrency Test",
      "priceDetail": ${SLOT_PRICE}
    }
  ],
  "paymentMethod": "CASH",
  "discountCodes": []
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/bookings</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Kiểm tra response code: 200=success, 500=bị từ chối (Redis lock) -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert: Response không phải 4xx lỗi hệ thống" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">400</stringProp>
              <stringProp name="49587">401</stringProp>
              <stringProp name="49588">403</stringProp>
              <stringProp name="49589">404</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Không được có lỗi 4xx (trừ 429 nếu rate-limit)</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">6</intProp>
          </ResponseAssertion>
          <hashTree/>

          <!-- Extractor: lấy bookingId từ response thành công -->
          <JSONPathExtractor guiclass="JSONPathExtractorGui" testclass="JSONPathExtractor"
                             testname="Extract bookingId" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">BOOKING_ID</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.bookingId</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">0</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">NOT_FOUND</stringProp>
          </JSONPathExtractor>
          <hashTree/>

          <!-- Debug Sampler: ghi ra log response -->
          <DebugSampler guiclass="TestBeanGUI" testclass="DebugSampler"
                        testname="Debug — In Response" enabled="false">
            <boolProp name="displayJMeterProperties">false</boolProp>
            <boolProp name="displayJMeterVariables">true</boolProp>
            <boolProp name="displaySystemProperties">false</boolProp>
          </DebugSampler>
          <hashTree/>
        </hashTree>

        <!-- Listener: View Results Tree (bật khi debug, tắt khi chạy thật) -->
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector"
                         testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">results/kb1_10users_results.jtl</stringProp>
        </ResultCollector>
        <hashTree/>

        <!-- Summary Report -->
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                         testname="Summary Report — KB1 10 Users" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">results/kb1_10users_summary.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

      <!-- ═══════════════════════════════════════════════════════════
           KỊCH BẢN 2: 50 NGƯỜI DÙNG ĐỒNG THỜI
           ═══════════════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="KB2 — 50 Người Dùng Đồng Thời (Cùng Sân/Slot)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>

      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                       testname="HTTP Headers (Auth + Content-Type)" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${JWT_TOKEN}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="POST /api/bookings — Đặt Sân (Tranh Giành Slot)" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "pitchId": "${PITCH_ID}",
  "userId": "${USER_ID}",
  "bookingDate": "${BOOKING_DATE}",
  "totalPrice": ${SLOT_PRICE},
  "bookingDetails": [
    {
      "slot": ${SLOT_ID},
      "name": "Slot ${SLOT_ID} - JMeter Concurrency Test",
      "priceDetail": ${SLOT_PRICE}
    }
  ],
  "paymentMethod": "CASH",
  "discountCodes": []
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/bookings</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert: No 4xx client errors" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">400</stringProp>
              <stringProp name="49587">401</stringProp>
              <stringProp name="49588">403</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">6</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector"
                         testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">results/kb2_50users_results.jtl</stringProp>
        </ResultCollector>
        <hashTree/>

        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                         testname="Summary Report — KB2 50 Users" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">results/kb2_50users_summary.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

      <!-- ═══════════════════════════════════════════════════════════
           KỊCH BẢN 3: 100 NGƯỜI DÙNG ĐỒNG THỜI
           ═══════════════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="KB3 — 100 Người Dùng Đồng Thời (Cùng Sân/Slot)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>

      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                       testname="HTTP Headers (Auth + Content-Type)" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${JWT_TOKEN}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="POST /api/bookings — Đặt Sân (Tranh Giành Slot)" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "pitchId": "${PITCH_ID}",
  "userId": "${USER_ID}",
  "bookingDate": "${BOOKING_DATE}",
  "totalPrice": ${SLOT_PRICE},
  "bookingDetails": [
    {
      "slot": ${SLOT_ID},
      "name": "Slot ${SLOT_ID} - JMeter Concurrency Test",
      "priceDetail": ${SLOT_PRICE}
    }
  ],
  "paymentMethod": "CASH",
  "discountCodes": []
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/bookings</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert: No 4xx client errors" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">400</stringProp>
              <stringProp name="49587">401</stringProp>
              <stringProp name="49588">403</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">6</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector"
                         testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">results/kb3_100users_results.jtl</stringProp>
        </ResultCollector>
        <hashTree/>

        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                         testname="Summary Report — KB3 100 Users" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">results/kb3_100users_summary.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

      <!-- ═══════════════════════════════════════════════════════════
           KỊCH BẢN KIỂM CHỨNG: Verify DB — Đếm Booking Sau Test
           ═══════════════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="KB-VERIFY — Kiểm Tra DB Sau Khi Test" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
      </ThreadGroup>

      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                       testname="HTTP Headers (Auth)" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${JWT_TOKEN}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- Gọi API kiểm tra slots đã đặt của pitch để xác nhận chỉ có 1 booking -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="GET /api/bookings/slots/{pitchId} — Verify Slot Đã Bị Khóa" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="date" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">date</stringProp>
                <stringProp name="Argument.value">${BOOKING_DATE}</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/bookings/slots/${PITCH_ID}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Verify response chứa SLOT_ID (slot đã bị đặt) -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert: Slot đã bị đặt xuất hiện trong response" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">${SLOT_ID}</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Slot ${SLOT_ID} phải xuất hiện trong danh sách booked slots!</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector"
                         testname="View Results Tree — Verify" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">results/verify_results.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

    </hashTree>
  </hashTree>
</jmeterTestPlan>